#1. Дано целое число (int). Определить сколько нулей в этом числе

value = input('введи целое число ')
print(value.count('0'))



